In [1]:
import pandas as pd
df=pd.read_csv('daatta.csv')
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [2]:
#head
import pandas as pd
df=pd.read_csv('daatta.csv')
print(df.head())

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [3]:
#tail
print(df.tail())

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [4]:
#info
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB
None

In [4]:
#create a simple pandas df
import pandas as pd
data={
    "calories":[420,380,390],
    "duration":[50,40,45]
}
df=pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [3]:
#return row 0
print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [6]:
#return row 0 and 1
print(df.loc[[0,1]])

   calories  duration
0       420        50
1       380        40

In [8]:
#named index
import pandas as pd
data={
    "calories":[420,380,390],
    "duration":[50,40,45]
}
df=pd.DataFrame(data,index=["day1","day2","day3"])
print(df)
#return day2
print(df.loc["day2"])

      calories  duration
day1       420        50
day2       380        40
day3       390        45
calories    380
duration     40
Name: day2, dtype: int64

In [9]:
#LOAD PYTHON DICTIONARY INTO A DF
import pandas as pd
data={
    "Duration":{
        "0":60,
        "1":60,
        "2":60,
    },
}
df=pd.DataFrame(data)
print(df)

   Duration
0        60
1        60
2        60

In [1]:
import pandas as pd

s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(s)

a    10
b    20
c    30
dtype: int64

In [2]:
data = {
    'Name': ['Ram', 'Shyam', 'Hari'],
    'Age': [21, 22, 23],
    'Marks': [85, 90, 88]
}

df = pd.DataFrame(data)
print(df)

    Name  Age  Marks
0    Ram   21     85
1  Shyam   22     90
2   Hari   23     88

In [3]:
#column selection
df['Name']

0      Ram
1    Shyam
2     Hari
Name: Name, dtype: object

In [4]:
#multiple columns
df[['Name', 'Marks']]

    Name  Marks
0    Ram     85
1  Shyam     90
2   Hari     88

In [5]:
#row selection
df.loc[1]

Name     Shyam
Age         22
Marks       90
Name: 1, dtype: object

In [6]:
df.iloc[2]

Name     Hari
Age        23
Marks      88
Name: 2, dtype: object

In [7]:
df.iloc[0]

Name     Ram
Age       21
Marks     85
Name: 0, dtype: object

In [10]:
#loc[row_label, column_label]
df.loc[1, 'Marks']

90

In [9]:
#iloc[row_position, column_position]
df.iloc[2, 1]

23

In [11]:
#Using loc (Inclusive)
df.loc[1:3]

    Name  Age  Marks
1  Shyam   22     90
2   Hari   23     88

In [12]:
#Using iloc (Exclusive end)
df.iloc[1:3]

    Name  Age  Marks
1  Shyam   22     90
2   Hari   23     88

In [13]:
#5Ô∏è‚É£ Slicing Columns
df.loc[:, 'Age':'Marks']

df.iloc[:, 1:3]

   Age  Marks
0   21     85
1   22     90
2   23     88

In [14]:
#6Ô∏è‚É£ Conditional Selection (Filtering)
df[df['Marks'] > 88]

    Name  Age  Marks
1  Shyam   22     90

In [15]:
#7Ô∏è‚É£ Multiple Conditions
df[(df['Marks'] > 85) & (df['Age'] > 22)]

   Name  Age  Marks
2  Hari   23     88

In [16]:
#8Ô∏è‚É£ Using isin()
df[df['Name'].isin(['Ram', 'Gita'])]

  Name  Age  Marks
0  Ram   21     85

In [17]:
#9Ô∏è‚É£ Boolean Indexing
condition = df['Age'] > 22
df[condition]

   Name  Age  Marks
2  Hari   23     88

In [18]:
#üîü Set Index & Selection
df2 = df.set_index('Name')
print(df2)

df2.loc['Ram']

       Age  Marks
Name
Ram     21     85
Shyam   22     90
Hari    23     88

Age      21
Marks    85
Name: Ram, dtype: int64

In [19]:
#1Ô∏è‚É£1Ô∏è‚É£ Reset Index
df2.reset_index()

    Name  Age  Marks
0    Ram   21     85
1  Shyam   22     90
2   Hari   23     88

In [20]:
#1Ô∏è‚É£2Ô∏è‚É£ Access Scalar Values
#Fast access
df.at[1, 'Marks']
df.iat[2, 2]

88

In [21]:
#Data Cleaning & Preprocessing
#Sample Data (Dirty Data)
import pandas as pd
import numpy as np

data = {
    'Name': ['Ram', 'Shyam', 'Hari', 'Ram', None],
    'Age': [21, np.nan, 23, 21, 22],
    'Marks': [85, 90, np.nan, 85, 88],
    'City': ['Hyderabad', 'Delhi', 'Mumbai', 'Hyderabad', None]
}

df = pd.DataFrame(data)
print(df)

    Name   Age  Marks       City
0    Ram  21.0   85.0  Hyderabad
1  Shyam   NaN   90.0      Delhi
2   Hari  23.0    NaN     Mumbai
3    Ram  21.0   85.0  Hyderabad
4   None  22.0   88.0       None

In [22]:
#1Ô∏è‚É£ Detect Missing Values
#Check missing values
df.isnull()

    Name    Age  Marks   City
0  False  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False  False
4   True  False  False   True

In [23]:
#Count missing values
df.isnull().sum()

Name     1
Age      1
Marks    1
City     1
dtype: int64

In [24]:
#Check non-missing values
df.notnull()

    Name    Age  Marks   City
0   True   True   True   True
1   True  False   True   True
2   True   True  False   True
3   True   True   True   True
4  False   True   True  False

In [25]:
#2Ô∏è‚É£ Handling Missing Values
#Drop rows with missing values
df.dropna()

  Name   Age  Marks       City
0  Ram  21.0   85.0  Hyderabad
3  Ram  21.0   85.0  Hyderabad

In [28]:
#Drop columns with missing values
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [29]:
#Fill missing values with a constant
df.fillna(0)

    Name   Age  Marks       City
0    Ram  21.0   85.0  Hyderabad
1  Shyam   0.0   90.0      Delhi
2   Hari  23.0    0.0     Mumbai
3    Ram  21.0   85.0  Hyderabad
4      0  22.0   88.0          0

In [30]:
#Fill with mean / median / mode
df['Age'].fillna(df['Age'].mean())
df['Marks'].fillna(df['Marks'].median())
df['City'].fillna(df['City'].mode()[0])

0    Hyderabad
1        Delhi
2       Mumbai
3    Hyderabad
4    Hyderabad
Name: City, dtype: object

In [31]:
#3Ô∏è‚É£ Remove Duplicate Data
#Check duplicates
df.duplicated()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [32]:
#Remove duplicates
df.drop_duplicates()

    Name   Age  Marks       City
0    Ram  21.0   85.0  Hyderabad
1  Shyam   NaN   90.0      Delhi
2   Hari  23.0    NaN     Mumbai
4   None  22.0   88.0       None

In [33]:
#4Ô∏è‚É£ Rename Columns
df.rename(columns={'Marks': 'Score', 'City': 'Location'})

    Name   Age  Score   Location
0    Ram  21.0   85.0  Hyderabad
1  Shyam   NaN   90.0      Delhi
2   Hari  23.0    NaN     Mumbai
3    Ram  21.0   85.0  Hyderabad
4   None  22.0   88.0       None

In [34]:
#5Ô∏è‚É£ Change Data Types
#Check data types
df.dtypes

Name      object
Age      float64
Marks    float64
City      object
dtype: object

In [47]:
#6Ô∏è‚É£ String Cleaning (Text Data)
df['Name'] = df['Name'].str.lower()
df['City'] = df['City'].str.strip()

In [46]:
df['City'] = df['City'].str.replace('Hyderabad', 'HYD')

In [45]:
#7Ô∏è‚É£ Handling Incorrect Values
#Replace wrong values
df['Marks'] = df['Marks'].replace(-1, np.nan)

In [44]:
#8Ô∏è‚É£ Outlier Handling
#Using condition
df[df['Marks'] < 100]

    Name   Age  Marks   City
0    ram  21.0   85.0    HYD
1  shyam   NaN   90.0  Delhi
3    ram  21.0   85.0    HYD
4   None  22.0   88.0   None

In [48]:
#Remove outliers
df = df[df['Marks'] >= 40]

In [52]:
#9Ô∏è‚É£ Data Normalization / Scaling
#Min-Max Normalization
df['Marks_norm'] = (df['Marks'] - df['Marks'].min()) / (df['Marks'].max() - df['Marks'].min())

In [53]:
#üîü Encoding Categorical Data
#Label Encoding
df['City_code'] = df['City'].astype('category').cat.codes

In [54]:
#One-Hot Encoding
pd.get_dummies(df, columns=['City'])

    Name   Age  Marks  Marks_norm  City_code  City_Delhi  City_HYD
0    ram  21.0   85.0         0.0          1           0         1
1  shyam   NaN   90.0         1.0          0           1         0
3    ram  21.0   85.0         0.0          1           0         1
4   None  22.0   88.0         0.6         -1           0         0

In [55]:
#1Ô∏è‚É£1Ô∏è‚É£ Filtering Clean Data
df_clean = df[(df['Age'] > 20) & (df['Marks'] > 80)]

In [57]:
"""
Pandas Practice ‚Äì 20 Questions with Output
Run this file to see all outputs.
"""

import pandas as pd
import numpy as np

print("\nQ1. Create a Series from a list")
s = pd.Series([10, 20, 30, 40])
print(s)

print("\nQ2. Create a Series with custom index")
s2 = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
print(s2)

print("\nQ3. Create a DataFrame from dictionary")
data = {
    'Name': ['Ram', 'Shyam', 'Hari'],
    'Age': [21, 22, 23],
    'Marks': [85, 90, 88]
}
df = pd.DataFrame(data)
print(df)

print("\nQ4. Display first 2 rows")
print(df.head(2))

print("\nQ5. Display last 2 rows")
print(df.tail(2))

print("\nQ6. Get column Names")
print(df.columns)

print("\nQ7. Select single column (Marks)")
print(df['Marks'])

print("\nQ8. Select multiple columns")
print(df[['Name', 'Marks']])

print("\nQ9. Select row using loc")
print(df.loc[1])

print("\nQ10. Select row using iloc")
print(df.iloc[2])

print("\nQ11. Add new column (Bonus = Marks + 5)")
df['Bonus'] = df['Marks'] + 5
print(df)

print("\nQ12. Filter students with Marks > 85")
print(df[df['Marks'] > 85])

print("\nQ13. Sort DataFrame by Age")
print(df.sort_values(by='Age'))

print("\nQ14. Check for null values")
print(df.isnull())

print("\nQ15. Create DataFrame with missing values")
df2 = pd.DataFrame({
    'A': [1, 2, np.nan],
    'B': [4, np.nan, 6]
})
print(df2)

print("\nQ16. Fill missing values with 0")
print(df2.fillna(0))

print("\nQ17. Drop rows with missing values")
print(df2.dropna())

print("\nQ18. Statistical summary using describe()")
print(df.describe())

print("\nQ19. Group by Age and calculate mean Marks")
print(df.groupby('Age')['Marks'].mean())

print("\nQ20. Merge two DataFrames")
df_left = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['A', 'B', 'C']
})

df_right = pd.DataFrame({
    'ID': [1, 2, 4],
    'Score': [90, 80, 70]
})

merged_df = pd.merge(df_left, df_right, on='ID', how='inner')
print(merged_df)

print("\n--- End of Pandas Practice File ---")

Q1. Create a Series from a list
0    10
1    20
2    30
3    40
dtype: int64

Q2. Create a Series with custom index
a    100
b    200
c    300
dtype: int64

Q3. Create a DataFrame from dictionary
    Name  Age  Marks
0    Ram   21     85
1  Shyam   22     90
2   Hari   23     88

Q4. Display first 2 rows
    Name  Age  Marks
0    Ram   21     85
1  Shyam   22     90

Q5. Display last 2 rows
    Name  Age  Marks
1  Shyam   22     90
2   Hari   23     88

Q6. Get column Names
Index(['Name', 'Age', 'Marks'], dtype='object')

Q7. Select single column (Marks)
0    85
1    90
2    88
Name: Marks, dtype: int64

Q8. Select multiple columns
    Name  Marks
0    Ram     85
1  Shyam     90
2   Hari     88

Q9. Select row using loc
Name     Shyam
Age         22
Marks       90
Name: 1, dtype: object

Q10. Select row using iloc
Name     Hari
Age        23
Marks      88
Name: 2, dtype: object

Q11. Add new column (Bonus = Marks + 5)
    Name  Age  Marks  Bonus
0    Ram   21     85     90
1  Shyam   22     90     95
2   Hari   23     88     93

Q12. Filter students with Marks > 85
    Name  Age  Marks  Bonus
1  Shyam   22     90     95
2   Hari   23     88     93

Q13. Sort DataFrame by Age
    Name  Age  Marks  Bonus
0    Ram   21     85     90
1  Shyam   22     90     95
2   Hari   23     88     93

Q14. Check for null values
    Name    Age  Marks  Bonus
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

Q15. Create DataFrame with missing values
     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

Q16. Fill missing values with 0
     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  6.0

Q17. Drop rows with missing values
     A    B
0  1.0  4.0

Q18. Statistical summary using describe()
        Age      Marks      Bonus
count   3.0   3.000000   3.000000
mean   22.0  87.666667  92.666667
std     1.0   2.516611   2.516611
min    21.0  85.000000  90.000000
25%    21.5  86.500000  91.500000
50%    22.0  88.000000  93.000000
75%    22.5  89.000000  94.000000
max    23.0  90.000000  95.000000

Q19. Group by Age and calculate mean Marks
Age
21    85.0
22    90.0
23    88.0
Name: Marks, dtype: float64

Q20. Merge two DataFrames
   ID Name  Score
0   1    A     90
1   2    B     80

--- End of Pandas Practice File ---

In [58]:
#1Ô∏è‚É£ Tables (DataFrame ‚Äì In-Memory Table)
import pandas as pd

data = {
    'ID': [1, 2, 3],
    'Name': ['Ram', 'Shyam', 'Hari'],
    'Marks': [85, 90, 88]
}

df = pd.DataFrame(data)
print(df)

   ID   Name  Marks
0   1    Ram     85
1   2  Shyam     90
2   3   Hari     88

In [59]:
#2Ô∏è‚É£ CSV File Example
#Create & Read CSV
import pandas as pd

# Create DataFrame
df = pd.DataFrame({
    'Name': ['A', 'B', 'C'],
    'Age': [20, 21, 22]
})

# Save to CSV
df.to_csv('students.csv', index=False)

# Read CSV
df_csv = pd.read_csv('students.csv')
print(df_csv)

  Name  Age
0    A   20
1    B   21
2    C   22

In [60]:
#3Ô∏è‚É£ Excel Sheet Example
#Create & Read Excel
import pandas as pd

df = pd.DataFrame({
    'Product': ['Pen', 'Book', 'Laptop'],
    'Price': [10, 50, 60000]
})

# Save to Excel
df.to_excel('products.xlsx', index=False)

# Read Excel
df_excel = pd.read_excel('products.xlsx')
print(df_excel)

  Product  Price
0     Pen     10
1    Book     50
2  Laptop  60000

In [61]:
#4Ô∏è‚É£ Database Example (SQLite)
import pandas as pd
import sqlite3

# Create connection
conn = sqlite3.connect('student.db')

# Create DataFrame
df = pd.DataFrame({
    'RollNo': [101, 102, 103],
    'Name': ['Ram', 'Shyam', 'Hari'],
    'Marks': [85, 90, 88]
})

# Store in database
df.to_sql('students', conn, if_exists='replace', index=False)

# Read from database
df_db = pd.read_sql("SELECT * FROM students", conn)
print(df_db)

conn.close()

   RollNo   Name  Marks
0     101    Ram     85
1     102  Shyam     90
2     103   Hari     88

In [62]:
#5Ô∏è‚É£ JSON File Example
#Create & Read JSON
import pandas as pd
data = {
    "students": [
        {"Name": "Ram", "Age": 21},
        {"Name": "Shyam", "Age": 22},
        {"Name": "Hari", "Age": 23}
    ]
}

# Save JSON
df = pd.json_normalize(data['students'])
df.to_json('students.json', orient='records')

# Read JSON
df_json = pd.read_json('students.json')
print(df_json)

    Name  Age
0    Ram   21
1  Shyam   22
2   Hari   23

In [63]:
#1Ô∏è‚É£ Vectorized Operations
#Vectorized operations perform element-wise operations without loops (fast & efficient).
import pandas as pd

df = pd.DataFrame({'Marks': [70, 80, 90]})

df['Bonus'] = df['Marks'] + 5
print(df)


#‚úî Faster than for loop
#‚úî Uses NumPy internally

   Marks  Bonus
0     70     75
1     80     85
2     90     95

In [65]:
#üìä 2Ô∏è‚É£ Broadcasting
#Broadcasting allows Pandas to apply operations between different shapes.

df['Percent'] = df['Marks'] / 100
print(df)
#Scalar value is automatically applied to all rows.

   Marks  Bonus  Percent
0     70     75      0.7
1     80     85      0.8
2     90     95      0.9

In [66]:
#3Ô∏è‚É£ Reshaping & Manipulation
#(a) reshape using reshape()
import numpy as np

arr = np.array([1,2,3,4])
print(arr.reshape(2,2))

#(b) pivot()
df = pd.DataFrame({
    'Day': ['Mon', 'Mon', 'Tue'],
    'Subject': ['Math', 'Sci', 'Math'],
    'Marks': [80, 90, 85]
})

print(df.pivot(index='Day', columns='Subject', values='Marks'))

#(c) melt()
print(pd.melt(df, id_vars=['Day']))

#(d) stack() & unstack()
df_stack = df.set_index(['Day','Subject'])
print(df_stack.unstack())

[[1 2]
 [3 4]]
Subject  Math   Sci
Day
Mon      80.0  90.0
Tue      85.0   NaN
   Day variable value
0  Mon  Subject  Math
1  Mon  Subject   Sci
2  Tue  Subject  Math
3  Mon    Marks    80
4  Mon    Marks    90
5  Tue    Marks    85
        Marks
Subject  Math   Sci
Day
Mon      80.0  90.0
Tue      85.0   NaN

In [67]:
#üßÆ 4Ô∏è‚É£ Mathematical Functions
df = pd.DataFrame({'A':[10,20,30],'B':[5,10,15]})

print(df.sum())
print(df.mean())
print(df.min())
print(df.max())
print(df.count())

#üìà 5Ô∏è‚É£ Statistical Functions
print(df.describe())
print(df.std())
print(df.var())
print(df.median())
print(df.corr())
#Used heavily in Data Analysis & ML preprocessing.

A    60
B    30
dtype: int64
A    20.0
B    10.0
dtype: float64
A    10
B     5
dtype: int64
A    30
B    15
dtype: int64
A    3
B    3
dtype: int64
          A     B
count   3.0   3.0
mean   20.0  10.0
std    10.0   5.0
min    10.0   5.0
25%    15.0   7.5
50%    20.0  10.0
75%    25.0  12.5
max    30.0  15.0
A    10.0
B     5.0
dtype: float64
A    100.0
B     25.0
dtype: float64
A    20.0
B    10.0
dtype: float64
     A    B
A  1.0  1.0
B  1.0  1.0

In [68]:
#üé≤ 6Ô∏è‚É£ Random Module (Pandas + NumPy)
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.randint(1,100,size=(5,3)),
                  columns=['A','B','C'])
print(df)

    A   B   C
0  96  99  33
1  98  45  92
2  94  33  20
3  24  97  31
4  82  80  12

In [69]:

#‚ûó 7Ô∏è‚É£ Linear Algebra (via NumPy + Pandas)
import numpy as np
import pandas as pd

a = pd.DataFrame([[1,2],[3,4]])
b = pd.DataFrame([[5,6],[7,8]])

print(np.dot(a, b))
#Used in ML algorithms.

[[19 22]
 [43 50]]

In [1]:
import pandas as pd

# DataFrame 1
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Ram', 'Shyam', 'Hari']
})

print("df1:")
print(df1)

# DataFrame 2
df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Marks': [85, 90, 88]
})

print("\ndf2:")
print(df2)

df1:
   ID   Name
0   1    Ram
1   2  Shyam
2   3   Hari

df2:
   ID  Marks
0   1     85
1   2     90
2   4     88

In [2]:
#üîó CONCAT Example
#Vertical Concatenation
result_concat = pd.concat([df1, df2], axis=0)
print(result_concat)

   ID   Name  Marks
0   1    Ram    NaN
1   2  Shyam    NaN
2   3   Hari    NaN
0   1    NaN   85.0
1   2    NaN   90.0
2   4    NaN   88.0

In [3]:
#üîó MERGE Example (Most Important)
result_merge = pd.merge(df1, df2, on='ID')
print(result_merge)

   ID   Name  Marks
0   1    Ram     85
1   2  Shyam     90

In [4]:
#üîó MERGE with Join Types
pd.merge(df1, df2, on='ID', how='left')
pd.merge(df1, df2, on='ID', how='right')
pd.merge(df1, df2, on='ID', how='outer')

   ID   Name  Marks
0   1    Ram   85.0
1   2  Shyam   90.0
2   3   Hari    NaN
3   4    NaN   88.0

In [5]:
#üîó JOIN Example (Index-based)
df1_indexed = df1.set_index('ID')
df2_indexed = df2.set_index('ID')

result_join = df1_indexed.join(df2_indexed)
print(result_join)

     Name  Marks
ID
1     Ram   85.0
2   Shyam   90.0
3    Hari    NaN